#include "test.h"
int main()
{
  int i, j, s = 0, v[3], w[6];
  int a[3][6] = {
      {85, 93, 84, 85, 95, 86},
      {79, 95, 95, 80, 100, 98},
      {80, 91, 93, 75, 97, 90}};
  for (i = 0; i < 3; i++)
  {
    for (j = 0; j < 6; j++)
    {
      s = s + a[i][j];
    }
    v[i] = s / 6;
    s = 0;
  }
  for (j = 0; j < 6; j++)
  {
    for (i = 0; i < 3; i++)
    {
      s = s + a[i][j];
    }
    w[j] = s / 3;
    s = 0;
  }
  printf("数学：%d\t 语文:%d\t 英语%d\n ", v[0], v[1], v[2]);
  printf("王笑：%d\t 李鹏：%d\t 吴昕：%d\t 张平：%d\t 赵明：%d\t 张晓娜：%d\n", w[0], w[1],
         w[2], w[3], w[4], w[5]);
}